package com.merqury.aspu.services.timetable.models

data class Corps(val name: String, val lat: String, val lon: String, val audiences: List<String>)

private val ASPUCorpses = listOf(
    Corps("Главный корпус", "45.001817", "41.132393", listOf(
        "1",
        "2",
        "3",
        "4",
        "4а",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "12",
        "13",
        "14",
        "14а",
        "15",
        "15а",
        "16",
        "17",
        "18",
        "19",
        "21",
        "22",
        "23",
        "23а",
        "23б",
        "23в"
    )),
    Corps("Корпус №1 и Общежитие №1","45.000517", "41.126859", listOf(
        "30",
        "31",
        "32",
        "33",
        "34",
        "35",
        "36",
        "37",
        "38",
        "101",
        "102",
        "103",
        "104",
        "105",
        "106",
        "107",
        "108",
        "109",
        "110",
        "111",
        "112",
        "113",
        "114",
        "115",
        "116",
        "117",
        "118",
        "119",
        "120",
        "121"
    )),
    Corps("Корпус №2","45.000415", "41.131333", listOf(
        "24",
        "25",
        "26",
        "27",
        "28"
    )),
    Corps("Корпус №3 (СПФ)","45.002263", "41.121873", listOf(
        "40",
        "41",
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49",
        "50"
    )),
    Corps("Корпус №4 (ФТЭиД)","45.003697", "41.122763", listOf(
        "51",
        "52",
        "53",
        "57",
        "58а",
        "58б",
        "59",
        "60",
        "61",
        "62",
        "63",
        "64",
        "65",
        "66",
        "67",
        "68"
    )),
    Corps("Корпус №5 (ЕБД)","45.003372", "41.121388", listOf(
        "80",
        "81",
        "82",
        "82а",
        "83",
        "84"
    )),
    Corps("Корпус №6 (ФОК)","45.006374", "41.128629", listOf(
        "85",
        "85а",
        "86",
        "86а",
        "Спортзал ФОК"
    )),
    Corps("ИСТФАК","44.989082", "41.126904", listOf(
        "201",
        "202",
        "203",
        "204",
        "205",
        "206",
        "207",
        "208",
        "209",
        "210"
    )),
    Corps("НЕИЗВЕСТНО", "45.001817", "41.132393", listOf())
)

fun getCorpsByAudience(audience: String): Corps {
    ASPUCorpses.forEach { corps ->
        corps.audiences.forEach {
            if(audience.lowercase() == it.lowercase())
                return corps
        }
    }
    return ASPUCorpses.filter { it.name == "НЕИЗВЕСТНО" }[0]
}